1)Что будет результатом следующих выражений?
"agility"[2:5] + "taxonomy"[3:6]
[115,202,192,334,257][:4]
len("crazy"[3:3+4])
[9,8,7,6,5,4,3,2,1][-3:]
type([False,True,False,True][2:3])
"---".join( "this is important".split() )
int( ''.join( "7/7/07".split('/') ) )
"too soon to tell".replace('o','*').replace('* ','')

iliono
[115, 202, 192, 334]
2
[3, 2, 1]
<class 'list'>
this---is---important
7707
t*s**n ttell

-

2) Напишите скрипт вычисляющий двумя способами длину строки.

my_str = 'Hello World!'
print(len(my_str)) 

my_str = input()
counter = 0    
for i in my_str:
    counter += 1
print(counter)

my_str = input()
counter = 0
while my_str[counter:]:
    counter += 1
print(counter)

-

3) Напишите скрипт, который позволяет из строки собрать другую по следующим правилам:
новая строка должна состоять из двух первых и двух последних элементов исходной строки.
Если длина исходной строки меньше 2-х то результатом будет пустая строка.

my_str = input()
new_str = (my_str[:2] + my_str[-2:])
if len(my_str) < 2: 
    new_str = '' 
    print(new_str)
else: print(new_str)

-

4) Напишите скрипт, который заменяет произвольный символ/букву в строке на "$".

5) Напишите скрипт, который позволяет инвертировать последовательность элементов в строке.

str = input() 
new_str = str[::-1]
print(new_str)

-

6) Напишите скрипт, который считает количество вхождений символа в строку. Например: "google.com" - {'o': 3, 'g': 2, '.': 1, 'e': 1, 'l': 1, 'm': 1, 'c': 1}

my_str = input()
new_dict = dict.fromkeys(my_str, 0)
for it in my_str:
    new_dict[it] += 1
print(new_dict)

-

7) Напишите скрипт, позволяющий из исходной строки собрать две новые. Первая строка должна состоять только из элементов с нечетными индексами исходной строки, а вторая с четнымы.

my_str = input()
new_str = my_str[1::2]
new_str_1 = my_str[::2]
print(new_str + new_str_1)

-

8) Напишите скрипт, который удаляет задаваемый произвольный символ в строке.

my_str = input()
str_list = list(my_str)
print('дай число')
a = int(input())
del str_list[a]
print(str_list)
v = '' 
output_str = v.join(str_list)
print(output_str)

-

9) Напишите скрипт, который позволяет переводить все символы исходной строки в верхний и нижный регистр.

string = input()
if string.islower():
    new_str = string.upper()
    print(new_str)
elif string.isupper():
    new_str = string.lower()
    print(new_str)
else: print(string)

-

10) Напишите скрипт, выводящий все элементы строки с их номерами индексов.

11) Напишите скрипт, проверяющий содержится ли произвольный символ (элемент) или слово в строке.

-

12) Выведите символ который встречается наиболее чаще в строке, чем остальные.

my_str = input()
new_dict = dict.fromkeys(my_str, 0)
for it in my_str:
    new_dict[it] += 1
max_value = max(new_dict.values())
counter_dict = { k: v for k,v in new_dict.items() if v == max_value }
print(counter_dict)

-

13) Поменяйте регистр элементов строки.

string = input()
if string.islower():
    new_str = string.upper()
    print(new_str)
elif string.isupper():
    new_str = string.lower()
    print(new_str)
else: print(string)

-

14) Вычислите сумму элементов (чисел) в списке двумя разными способами.

15) Умножте каждый элемент списка на произвольное число.

16) Найдите максимальное и минимальное число, хранящееся в списке.

17) Напишите скрипт, удаляющий все повторяющиеся элементы из списка.

18) Скопируйте список двумя различными способами.

19) Напишите скипт для слияния (конкатенации) двух списков различными способами.

20) Напишите скрипт, меняющий позициями элементы списка с индексами n и n+1.

21) Напишите скрипт, переводящий список из различного количества числовых целочисленных элементов в одно число.
Пример списка: [15, 23, 150]
Результат: 1523150